<h3>Reading and Writing Data in Text Format</h3>

Function Description<br>
read_csv Load delimited data from a file, URL, or file-like object. Use comma as default delimiter<br>
read_table Load delimited data from a file, URL, or file-like object. Use tab ('\t') as default delimiter<br>
read_fwf Read data in fixed-width column format (that is, no delimiters)<br>
read_clipboard Version of read_table that reads data from the clipboard. Useful for converting tables from web pages<br>

In [16]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv('ex1.csv')

In [8]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
pd.read_table('ex1.csv', sep=',')

C:\Users\mramirez\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [23]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [24]:
pd.read_csv('ex2.csv', names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [25]:
names = ['a', 'b', 'c', 'd', 'message']

In [26]:
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [28]:
parsed = pd.read_csv('csv_mindex.csv', index_col=['key1', 'key2'])

In [29]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [30]:
list(open('ch06/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

While you could do some munging by hand, in this case fields are separated by a variable
amount of whitespace. This can be expressed by the regular expression \s+, so we have
then:

In [31]:
result = pd.read_csv('ch06/ex3.csv', sep='\s+')

In [32]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [33]:
pd.read_csv('ch06/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [34]:
result = pd.read_csv('ch06/ex5.csv')

In [35]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [36]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

The na_values option can take either a list or set of strings to consider missing values:

In [37]:
result = pd.read_csv('ch06/ex5.csv', na_values=['NULL'])

In [38]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

Different NA sentinels can be specified for each column in a dict:

In [39]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [40]:
pd.read_csv('ch06/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

Argument Description<br>
path String indicating filesystem location, URL, or file-like object<br>
sep or delimiter Character sequence or regular expression to use to split fields in each row<br>
header Row number to use as column names. Defaults to 0 (first row), but should be None if there is no header
row<br>
index_col Column numbers or names to use as the row index in the result. Can be a single name/number or a list
of them for a hierarchical index<br>
names List of column names for result, combine with header=None<br>
skiprows Number of rows at beginning of file to ignore or list of row numbers (starting from 0) to skip<br>
na_values Sequence of values to replace with NA<br>
comment Character or characters to split comments off the end of lines<br>
parse_dates Attempt to parse data to datetime; False by default. If True, will attempt to parse all columns. Otherwise
can specify a list of column numbers or name to parse. If element of list is tuple or list, will combine
multiple columns together and parse to date (for example if date/time split across two columns)<br>
keep_date_col If joining columns to parse date, drop the joined columns. Default True<br>
converters Dict containing column number of name mapping to functions. For example {'foo': f} would apply
the function f to all values in the 'foo' column<br>
dayfirst When parsing potentially ambiguous dates, treat as international format (e.g. 7/6/2012 -> June 7,
2012). Default False<br>
date_parser Function to use to parse dates<br>
nrows Number of rows to read from beginning of file<br>
iterator Return a TextParser object for reading file piecemeal<br>
chunksize For iteration, size of file chunks<br>
skip_footer Number of lines to ignore at end of file<br>
verbose Print various parser output information, like the number of missing values placed in non-numeric
columns<br>
encoding Text encoding for unicode. For example 'utf-8' for UTF-8 encoded text<br>
squeeze If the parsed data only contains one column return a Series<br>
thousands Separator for thousands, e.g. ',' or '.'<br>

<h3>Reading Text Files in Pieces</h3>

In [2]:
result = pd.read_csv('ch06/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
5     1.817480  0.742273  0.419395 -2.251035   Q
6    -0.776764  0.935518 -0.332872 -1.875641   U
7    -0.913135  1.530624 -0.572657  0.477252   K
8     0.358480 -0.497572 -0.367016  0.507702   S
9    -1.740877 -1.160417 -1.637830  2.172201   G
10    0.240564 -0.328249  1.252155  1.072796   8
11    0.764018  1.165476 -0.639544  1.495258   R
12    0.571035 -0.310537  0.582437 -0.298765   1
13    2.317658  0.430710 -1.334216  0.199679   P
14    1.547771 -1.119753 -2.277634  0.329586   J
15   -1.310608  0.401719 -1.000987  1.156708   E
16   -0.088496  0.634712  0.153324  0.415335   B
17   -0.018663 -0.247487 -1.446522  0.750938   A
18   -0.070127 -1.579097  0.120892  0.671432   F
19   -0.194678 -0.492039  2.359605  0.319810   H
20   -0.248618  0.868707 -0.492226 -0.717959   W
21   -1.091549 -0.867110 -0.647760 -0.832562   C
22    0.641404 -0.138822 -0.621963 -0.284839   C
23    1.216408  0.992687  0.165162 -0.069619   V
24   -0.564474  0.792832  0.747053  0.571675   I
25    1.759879 -0.515666 -0.230481  1.362317   S
26    0.126266  0.309281  0.382820 -0.239199   L
27    1.334360 -0.100152 -0.840731 -0.643967   6
28   -0.737620  0.278087 -0.053235 -0.950972   J
29   -1.148486 -0.986292 -0.144963  0.124362   Y
...        ...       ...       ...       ...  ..
9970  0.633495 -0.186524  0.927627  0.143164   4
9971  0.308636 -0.112857  0.762842 -1.072977   1
9972 -1.627051 -0.978151  0.154745 -1.229037   Z
9973  0.314847  0.097989  0.199608  0.955193   P
9974  1.666907  0.992005  0.496128 -0.686391   S
9975  0.010603  0.708540 -1.258711  0.226541   K
9976  0.118693 -0.714455 -0.501342 -0.254764   K
9977  0.302616 -2.011527 -0.628085  0.768827   H
9978 -0.098572  1.769086 -0.215027 -0.053076   A
9979 -0.019058  1.964994  0.738538 -0.883776   F
9980 -0.595349  0.001781 -1.423355 -1.458477   M
9981  1.392170 -1.396560 -1.425306 -0.847535   H
9982 -0.896029 -0.152287  1.924483  0.365184   6
9983 -2.274642 -0.901874  1.500352  0.996541   N
9984 -0.301898  1.019906  1.102160  2.624526   I
9985 -2.548389 -0.585374  1.496201 -0.718815   D
9986 -0.064588  0.759292 -1.568415 -0.420933   E
9987 -0.143365 -1.111760 -1.815581  0.435274   2
9988 -0.070412 -1.055921  0.338017 -0.440763   X
9989  0.649148  0.994273 -1.384227  0.485120   Q
9990 -0.370769  0.404356 -1.051628 -1.050899   8
9991 -0.409980  0.155627 -0.818990  1.277350   W
9992  0.301214 -1.111203  0.668258  0.671922   A
9993  1.821117  0.416445  0.173874  0.505118   X
9994  0.068804  1.322759  0.802346  0.223618   H
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

If you want to only read out a small number of rows (avoiding reading the entire file),
specify that with nrows :

In [4]:
pd.read_csv('ch06/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

To read out a file in pieces, specify a chunksize as a number of rows:

In [5]:
chunker = pd.read_csv('ch06/ex6.csv', chunksize=1000)

In [6]:
chunker

The TextParser object returned by read_csv allows you to iterate over the parts of the
file according to the chunksize . For example, we can iterate over ex6.csv , aggregating
the value counts in the 'key' column like so:

In [9]:
chunker = pd.read_csv('ch06/ex6.csv', chunksize=1000)

tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

In [10]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

<h3>Writing Data Out to Text Format</h3>

In [13]:
data = pd.read_csv('ch06/ex5.csv', nrows=5)
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

Using DataFrameâ€™s to_csv method, we can write the data out to a comma-separated file:

In [20]:
data.to_csv('ch06/out1.csv')

In [21]:
!cat ch06/out1.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

Other delimiters can be used, of course (writing to sys.stdout so it just prints the text
result):

In [24]:
data.to_csv('sys.stdout', sep='|')

In [25]:
!cat sys.stdout

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

Missing values appear as empty strings in the output. You might want to denote them
by some other sentinel value:

In [26]:
data.to_csv('sys.stdout', na_rep='NULL')

In [27]:
!cat sys.stdout

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

With no other options specified, both the row and column labels are written. Both of
these can be disabled:

In [28]:
data.to_csv('sys.stdout', index=False, header = False)

In [29]:
!cat sys.stdout

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

You can also write only a subset of the columns, and in an order of your choosing:

In [31]:
data.to_csv('sys.stdout', index=False, columns = ['a','b','c'])

In [32]:
!cat sys.stdout

a,b,c
1,2,3.0
5,6,
9,10,11.0

Series also has a to_csv method:

In [33]:
dates = pd.date_range('1/1/2000', periods=7)

In [35]:
ts = pd.Series(np.arange(7), index=dates)

In [36]:
ts.to_csv('ch06/tseries1.csv')

In [37]:
!cat ch06/tseries1.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

With a bit of wrangling (no header, first column as index), you can read a CSV version
of a Series with read_csv , but there is also a from_csv convenience method that makes
it a bit simpler:

In [39]:
pd.Series.from_csv('ch06/tseries1.csv', parse_dates=True)

/home/miguel/anaconda3/lib/python3.7/site-packages/pandas/core/series.py:3727: FutureWarning: from_csv is deprecated. Please use read_csv(...) instead. Note that some of the default arguments are different, so please refer to the documentation for from_csv when changing your function calls
  infer_datetime_format=infer_datetime_format)

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
dtype: int64

<h3>Manually Working with Delimited Formats</h3>

In [3]:
import csv

In [4]:
f = open('ch06/ex7.csv')

In [5]:
reader = csv.reader(f)

In [6]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [7]:
lines = list(csv.reader(open('ch06/ex7.csv')))

In [8]:
header, values = lines[0], lines[1:]

In [9]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

Argument Description<br>
delimiter One-character string to separate fields. Defaults to ','.<br>
lineterminator Line terminator for writing, defaults to '\r\n'. Reader ignores this and recognizes
cross-platform line terminators.<br>
quotechar Quote character for fields with special characters (like a delimiter). Default is '"'.<br>
quoting Quoting convention. Options include csv.QUOTE_ALL (quote all fields),<br>
csv.QUOTE_MINIMAL (only fields with special characters like the delimiter),
csv.QUOTE_NONNUMERIC, and csv.QUOTE_NON (no quoting). See Pythonâ€™s
documentation for full details. Defaults to QUOTE_MINIMAL.<br>
skipinitialspace Ignore whitespace after each delimiter. Default False.<br>
doublequote How to handle quoting character inside a field. If True, it is doubled. See online
documentation for full detail and behavior.<br>
escapechar String to escape the delimiter if quoting is set to csv.QUOTE_NONE. Disabled by
default<br>

<h3>JSON Data</h3>

In [10]:
import json

In [11]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"},
{"name": "Katie", "age": 33, "pet": "Cisco"}]
}
"""

In [12]:
result = json.loads(obj)

In [13]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 25, 'pet': 'Zuko'},
  {'name': 'Katie', 'age': 33, 'pet': 'Cisco'}]}

In [14]:
asjson = json.dumps(result)

In [17]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [18]:
siblings

    name  age
0  Scott   25
1  Katie   33

<h3>XML and HTML: Web Scraping</h3>